/**
 * author :zy
 * time: 2016年7月14日17:32:55
 * description: 角色设置 控制器
 */
define(["angular", "services/current-user-service"], function (angular) {
    return angular.module("oemRoleDataMap.services", ["service.currentUser"])
        .factory("oemRoleDataMapService", [
            "currentUserService",
            function (currentUserService) {
                var oemRoleDataMapService = {};

                //父子关系
                oemRoleDataMapService.functionRelation = {
                    0: [50600,50500, 50400, 50700,50300, 50100, 50200,50800], //一级权限
                    50500: [50501, 50502,50503],
                    50200: [50205, 50201, 50202, 50203, 50204],
                    50800: [50801, 50802, 50803, 50804, 50805, 50806, 50807, 50808, 50809, 50810, 50811, 50812, 50813, 50814],
                    50503: [50504,50505,50506]



                };
                //爷孙关系
                oemRoleDataMapService.functionRelation2 = {
                    50100: [50101, 50102, 50103, 50104, 50105, 50106, 50107],
                    50300: [50302, 50303, 50304, 50305, 50306, 50307, 50308, 50309, 50310, 50313, 50311, 50312],
                    50400: [50402, 50403, 50404, 50405],
                    50600: [50601, 50602, 50603, 50604],
                    50700: [50701, 50702, 50703, 50704, 50705, 50706]
                    

                };

                //所有的权限id，name对应表
                oemRoleDataMapService.functionNameConfig = {
                    50100: "员工",
                    50101: "新建",
                    50102: "编辑",
                    50103: "删除",
                    50104: "离职/复职",
                    50105: "重置密码",
                    50106: "布置任务",
                    50107: "销售目标",
                    //统计分析
                    50200: "统计分析",
                    50201: "线索量分析",
                    50202: "跟进量分析",
                    50203: "销售额分析",
                    50204: "签约量分析",
                    50205: "咨询量分析", //new add  2016/10/17

                    //线索
                    50300: "线索",
                    50302: "新建",
                    50303: "编辑",
                    50304: "删除",
                    50305: "分配",
                    50306: "合并",
                    50307: "转校",
                    50308: "签约",
                    50309: "+1Course学员账号",
                    50310: "Excel导入",
                    50311: "编辑签约信息",
                    50312: "修改签约金额",
                    50313: "从校宝秀导入",

                    //渠道
                    50400: "渠道",
                    50402: "新建",
                    50403: "编辑",
                    50404: "删除",
                    50405: "启用/禁用",

                    //营销工具
                    50500: "营销工具",
                    50501: "入学测试",
                    50502: "校宝秀",
                    50503: "直播课",
                    50504:"新建",
                    50505:"编辑",
                    50506:"删除",

                    //产品库
                    50600: "产品库",
                    50601: "新建",
                    50602: "删除",
                    50603: "编辑",
                    50604: "上架/下架",

                    //咨询
                    50700: "咨询",
                    50701: "新建",
                    50702: "删除",
                    50703: "编辑",
                    50704: "改判",
                    50705: "Excel导入",
                    50706: "从校宝秀导入",
                    //数据报表
                    50800: "数据报表",
                    50801: "市场报表",
                    50802: "销售报表",
                    50803: "财务报表",
                    50804: "销售额明细表",
                    50805: "销售额总表",
                    50806: "线索类别分布明细表",
                    50807: "市场部渠道咨询量状态明细表",
                    50808: "市场部咨询记录明细表",
                    50809: "销售人员预约情况明细表",
                    50810: "市场部完成情况月度分析表",
                    50811: "市场渠道完成情况月度分析表",
                    50812: "市场人员完成情况月度分析表",
                    50813: "销售部完成情况月度分析表",
                    50814: "销售人员完成情况月度分析表",

                    //超级管理员
                    40000: "超级管理员"

                }; //描述
                oemRoleDataMapService.descriptionRelation = {
                    '50300': "", //学员

                };
                return oemRoleDataMapService;
            }
        ]);
});