/**
 * Created by AbirdPc on 2015/4/14.
 */
define(["angular"],
    function(angular) {
        return angular.module("service.currentUser", [])
            .factory("currentUserService",
            [
                "$http", "$timeout", "$q", "$window", function($http, $timeout, $q, $window) {
                    var currentUser;

                    return {
                        setCurrentUser: function(user) {
                            currentUser = user;
                        },
                        hasPermission: function(permissions, isRedirect) {
                            var flg = false;
                            for (var i = 0; i < permissions.length; i++) {
                                if (flg) {
                                    break;
                                }
                                if (currentUser.userFunction == null) {
                                    var school = document.cookie ? document.cookie.match(/\bschool=([^;]+)/)[1] : null;
                                    location.href = school ? '/' + school + '/Login' : "/";
                                    var d = $q.defer();
                                    d.reject();
                                    return d.promise;
                                }
                                for (var j = 0; j < currentUser.userFunction.length; j++) {
                                    if (permissions[i] == currentUser.userFunction[j]) {
                                        flg = true;
                                        break;
                                    }
                                }
                            }
                            if (flg) {
                                return true;
                            } else {
                                if (isRedirect) {
                                    var school = document.cookie ? document.cookie.match(/\bschool=([^;]+)/)[1] : null;
                                    location.href = school ? '/' + school + '/Login' : "/";
                                    var d = $q.defer();
                                    d.reject();
                                    return d.promise;
                                } else {
                                    return false;
                                }
                            }
                        },
                        getCurrentUser: function() {
                            return currentUser;
                        },
                        JudgeRedirectToLogin: function(hasPermission) {
                            var deferred = $q.defer();
                            if (hasPermission) {
                                deferred.resolve(true);
                            } else {
                                var school = document.cookie ? document.cookie.match(/\bschool=([^;]+)/)[1] : null;
                                location.href = school ? '/' + school + '/Login' : "/";
                                deferred.reject(false);
                            }
                            return deferred.promise;
                        }
                    };
                }
            ])
            .constant('rolesService',
            {
                //员工
                "crm_员工": 50000,
                "crm_员工管理": 50100,
                "crm_员工新建": 50101,
                "crm_员工编辑": 50102,
                "crm_员工删除": 50103,
                "crm_员工状态": 50104,
                "crm_员工重置密码": 50105,
                "crm_员工布置任务": 50106,
                "crm_员工销售目标": 50107,
                //统计分析
                "crm_统计分析": 50200,
                "crm_线索量分析": 50201,
                "crm_跟进量分析": 50202,
                "crm_销售额分析": 50203,
                "crm_签约量分析": 50204,
                "crm_咨询量分析": 50205, //new add  2016/10/17

                //线索
                "crm_线索": 50300,
                "crm_线索管理": 50301,
                "crm_线索新建": 50302,
                "crm_线索编辑": 50303,
                "crm_线索删除": 50304,
                "crm_线索分配": 50305,
                "crm_线索合并": 50306,
                "crm_线索转校": 50307,
                "crm_线索签约": 50308,
                "crm_线索Course权限": 50309,
                "crm_线索批量导入": 50310,
                "crm_线索签约信息编辑": 50311,
                //"crm_线索签约金额编辑": 50312,  //CRM1.6已去掉此权限--SaberWang
                "crm_从校宝秀导入": 50313,
                "crm_线索共享": 50314,

                //渠道
                "crm_渠道": 50400,
                "crm_渠道管理": 50401,
                "crm_渠道新建": 50402,
                "crm_渠道编辑": 50403,
                "crm_渠道删除": 50404,
                "crm_渠道状态": 50405,

                //营销工具
                "crm_营销工具": 50500,
                "crm_入学测试": 50501,
                "crm_校宝秀": 50502,
                "crm_直播课": 50503,
                "crm_直播课新建": 50504,
                "crm_直播课编辑": 50505,
                "crm_直播课删除": 50506,

                //产品库
                "crm_产品库": 50600,
                "crm_产品库新建": 50601,
                "crm_产品库删除": 50602,
                "crm_产品库编辑": 50603,
                "crm_产品库状态": 50604,

                //咨询
                "crm_咨询": 50700,
                "crm_咨询新建": 50701,
                "crm_咨询删除": 50702,
                "crm_咨询编辑": 50703,
                "crm_咨询改判": 50704,
                "crm_咨询Excel导入": 50705,
                "crm_咨询从校宝秀导入": 50706,

                //数据报表
                "crm_数据报表": 50800,
                "crm_市场报表": 50801,
                "crm_销售报表": 50802,
                "crm_财务报表": 50803,
                //以下数据报表权限 由后端控制
                "crm_销售额明细表": 50804,
                "crm_销售额总表": 50805,
                "crm_线索类别分布明细表": 50806,
                "crm_市场部渠道咨询量状态明细表": 50807,
                "crm_市场部咨询记录明细表": 50808,
                "crm_销售人员预约情况明细表": 50809,
                "crm_市场部完成情况月度分析表": 50810,
                "crm_市场渠道完成情况月度分析表": 50811,
                "crm_市场人员完成情况月度分析表": 50812,
                "crm_销售部完成情况月度分析表": 50813,
                "crm_销售人员完成情况月度分析表": 50814,

                //超级管理员
                "crm_超级管理员": 40000

            })
            //20000以后是后端报错信息
            .constant('messages',
            {
                //前端公用部分或其他
                10001: "请输入{0}！", //请输入（必填项名称）
                10002: "请选择{0}！", //请选择（必填项名称）！
                10003: "{0}最多允许输入{1}个字！", //（输入项名称）最多允许输入（字数限制数）个字！
                10004: "{0}只支持输入0或小数点后最多两位的正数！", //（输入项名称）只支持输入0或小数点后最多两位的正数！
                10005: "{0}已存在！", //（输入项名称）已存在！
                10006: "用户名已存在！",

                //前端员工
                11000: "",

                //前端线索
                12000: "",

                //前端渠道
                13000: "",

                //前端营销工具
                14000: "",

                //超级管理员
                19000: "",
                19001: "请至少勾选2个要合并的账号！",

                //渠道相关
                22001: "{0}不是您创建的渠道，无法删除！",
                22002: "渠道{0}已被关联，无法删除！",
                22003: "渠道名称已存在！",
                22004: "渠道类别已经被删除，请重新选择！",
                22005: "使用者{0}已经被删除账号，请重新选择！",
                22006: "使用者{0}已经不在{1}内，请重新选择！",
                22007: "操作失败，当前渠道可能已被其他用户删除！",
                22008: '所选入学测试可能已被其他用户删除，请重新选择！',
                22009: '所选直播可能已被其他用户删除，请重新选择！',
                //线索相关
                23001: "已存在与该手机号码相同的线索！",
                23002: "{0}内已经不存在渠道{1}，请重新选择！", //（已选线索的校区名称）内已经不存在渠道（所选渠道名称），请重新选择！
                23003: "线索类别{0}已经被删除，请重新选择！", //线索类别（类别名称）已经被删除，请重新选择！
                23004: "跟进人{0}已经不在{1}内，请重新选择！", //跟进人（跟进人姓名）已经不在（所选线索校区名称）内，请重新选择！
                23005: "{0}已被关联，无法删除！",
                23006: "{0}已经签约",
                23007: "所选线索不在同一个校区，建议按校区筛选后，再做批量分配！",
                23008: "所选文件表头与导入模板表头不一致，请检查后重新上传！",
                23009: "每次最多只支持1000条记录批量导入，请检查后重新上传！",
                23010: "{0}还未签约，请签约后再开通1Course学员账号！",
                23011: "{0}已经开通1Course学员账号，请不要重复开通！",
                23012: "1Course站点{0}中已经存在用户名为{1}的学员账号，如果不是同一学员已经开通的账号，请修改线索手机号码后再开通！",
                23016: "所选渠道已经被删除，请重新选择！",
                23017: "您已不在{0}内，请重新选择！",
                23018: "您已无权使用渠道{0}，请重新选择！",
                //入测
                23013: "测试不存在！",
                23014: "测试报告无法查看！",
                23015: "操作失败，所选线索可能已被其他用户删除！",

                //员工相关
                25001: "用户名或密码不正确！",
                25002: "用户被禁用！",
                25003: "请输入用户名！",
                25004: "请输入密码！",
                25006: "用户名重复！",
                25007: "用户状态选择错误！",
                25008: "请输入姓名！",
                25009: "{0}在CRM中已经绑定相关数据，无法删除。如需限制登录，可将账号状态改为“离职”！",
                25010: "两次密码不一致！",
                25011: "登录失败！",
                25012: "跟进人{0}已经被删除账号，请重新选择！",
                25013: "用户权限不存在！",
                25014: "原始密码错误！",
                25015: "{0}还有正在跟进的线索，建议先处理这些线索后再离职！",
                25016: "所选部门已被删除，请重新选择！",
                25017: "存在上下级关系不成立的上级或下级，请修改后重新保存！",
                //机构校区
                26001: "当前登录机构不存在！",
                26002: "当前校区不存在！",

                //角色相关
                26003: "角色不存在！",
                26004: "请输入任务名称！",
                26005: "角色已绑定用户！",
                26006: "权限不能为空！",
                26007: "角色名已存在！",


                //系统参数
                26501: "请输入类别名称！",
                26502: "类别不存在！",
                26503: "类别属性不存在！",
                //销售任务
                27001: "请输入任务名称！",
                //咨询模块
                28000: "已存在与该手机号码相同的记录！",
                28001: "您已不在{consultSchoolName}内，请重新选择！",
                28002: "{consultSchoolName}内已经不存在渠道{channelName}，请重新选择！",
                28003: "您已无权使用渠道{channelName}，请重新选择！",
                28004: "获取人{getterName}已经不在{consultSchoolName}内，请重新选择！",
                28005: "所选咨询记录不在同一个校区，建议按校区筛选后，再做批量改判！",
                28006: "{clueStuNames}已被关联，无法删除！",
                28007: "所选文件表头与导入模板表头不一致，请检查后重新上传！",
                28008: "每次最多只支持1000条记录批量导入，请检查后重新上传！",
                28009: "操作失败，所选咨询可能已被其他用户删除！",
                28010: "获取人{getterName}已经被删除账号，请重新选择！",
                //产品模块
                29001: "请输入产品编号！",
                20992: "请输入产品名称！",
                29003: "产品编号已存在！",
                29004: "请输入产品售价！",
                29005: "请输入总课时！",
                29006: "所添加的签约产品已被删除，请重新选择！",
                //29007: "{0}已不再销售{1}，请重新选择！",        //与29008描述相同，暂时不用
                29008: "{0}已不再销售{1}，请重新选择！",
                29009: "{0}已被关联，无法删除！",
                29010: "所添加的签约产品已被删除，请重新选择！",
                29011: "所选产品类别已被删除，请重新选择！",
                29012: "您已经不在{0}内，请重新选择！",
                29013: "操作失败，当前产品可能已被其他用户删除！", //现改为产品被并发删除时，继续操作会跳转到错误页，并没有文案提示
                //校宝秀相关
                30000: "您已不在导入校区内，请重试！",
                30001: "您的校宝秀账号已绑定，请勿重复操作！",
                30002: "用户名或密码不正确",
                30003: "机构账户被锁定",
                30005: "未知的校宝秀账户错误",
                30006: "没有要导入的数据",
                30007: "机构账户不存在",
                //公用部分
                30004: "无操作数据！",
                310000: "该时间段内已存在直播，请调整直播时间，或在其他课堂中新建直播！",
                310006: "所选主讲老师可能已经被删除账号，请重新选择！",
                100001: "该数据已被其他人删除，请刷新后重试！",
                100002: "该数据已被其他人反馈，请刷新后重试！",
                100003: function() { location.href = "/Home/Error"; },
                100004: "操作失败，您的登录账号可能已被删除！",
                100005: "不能删除系统数据",
                100006: "不能编辑系统数据"

            });
    });
